* Text Search

This are the starting notes for implementation of a text vector implementation
for nodal.

Let's say for any text search, we want to identify an attribute, and a list of
items that get included in that item.  For example q(title,ocr)::tsvector is a
tsvector type, where we can ask fpr q=foo+bar => ts

In this case we want to be able to query like q=, so.

#+name: catalog vector
#+header: :engine postgresql :database wine_price_development
#+BEGIN_SRC sql
alter table catalogs add q tsvector;

CREATE TRIGGER q_tsvectorupdate BEFORE INSERT OR UPDATE
ON catalogs FOR EACH ROW EXECUTE PROCEDURE
tsvector_update_trigger(q, 'pg_catalog.english', title, ocr);

#+END_SRC

#+RESULTS: catalog vector
| ALTER TABLE    |
|----------------|
| CREATE TRIGGER |


If I do some stop word statistics, it looks like we need to do some
modifications to the stop words and the synynoyms.

#+name: search dictionary
#+header: :engine postgresql :database wine_price_development
#+BEGIN_SRC sql
select * from ts_stat('select q from catalogs') order by nentry desc, ndoc desc,word;

-- Specialized stop words
CREATE TEXT SEARCH DICTIONARY public.wine (
    TEMPLATE = pg_catalog.simple,
    STOPWORDS = wine,
    ACCEPT= false
);

-- wine.syn in public has synonyms
CREATE TEXT SEARCH DICTIONARY
public.wine_syn (
 TEMPLATE = synonym,
 SYNONYMS = wine
);

create text search configuration public.wine ( COPY=pg_catalog.english);

alter text search configuration wine
ALTER MAPPING FOR asciiword, asciihword, hword_asciipart,word, hword, hword_part
WITH wine_syn, wine_stop,english_stem;

alter text search configuration wine
drop mapping for email,url,url_path,sfloat,float;

select * from ts_debug('public.wine','Chateau Rothchild e chatea');
--

SET default_text_search_config = 'public.wine';

#+END_SRC

#+RESULTS: search dictionary
| word | ndoc | nentry |
|------+------+--------|

select
title,ts_headline('english',ocr,phraseto_tsquery('champagne'),MaxFragments=4)
from catalogs;

In order to cascade our data into the individual pages:

Then, when we do a q= query, we want it to become a
q @@ plainto_tsquery(PARM);

Then to move to pages;

alter table pages add ocr text,
alter table pages add q tsvector;

CREATE TRIGGER q_tsvectorupdate
BEFORE INSERT OR UPDATE
ON pages FOR EACH ROW EXECUTE PROCEDURE
tsvector_update_trigger(q, 'public.wine', ocr);

with c as (
 select id as catalog_id,a.page-1 as page,a.ocr
 from catalogs,regexp_split_to_table(ocr,'\x0C') with ordinality a(ocr,page)
)
update pages p set ocr=c.ocr from c where p.catalog_id=c.catalog_id and
 p.page=c.page;


-- Test with
select
catalog_id,page,
ts_headline('public.wine',ocr,phraseto_tsquery('james_beard'))
from pages
where q @@ phraseto_tsquery('james beard');

* Nodal Migration

In order to get the data from the nodal setup, I needed some migration steps.
These are included below, but are probably not needed anymore.

#+BEGIN_SRC
set search_path=catalogs,public,pg_catalog;

create temp table catalog_id_uuid as
with a as (
 select
 gen_random_uuid() as catalog_id,
 gen_random_uuid() as media_id,*
 from public.catalogs
),
b as (
 insert into media (media_id,title,contents,mime_type,thumbnail_png,ocr)
 select media_id,title,contents,contenttype,thumbnail,ocr
 from a returning media_id
),
c as (
 insert into catalogs (catalog_id,title,publisher,year,media_id)
 select catalog_id,title,publisher,year,media_id from a returning *
)
select id,catalog_id from a;

-- Get per page OCR
create temp table page_ocr as
with c as (
select catalog_id,
a.page-1 as page,
a.ocr
from public.catalogs join
catalog_id_uuid using(id),
regexp_split_to_table(ocr,'\x0C') with ordinality a(ocr,page)
)
select catalog_id,page,ocr from c;

create temp table page_id_uuid as
with a as (
select
gen_random_uuid() as page_id,
gen_random_uuid() as media_id,
c.catalog_id,
c.title || ' (pg. ' || p.page+1 || ')' as title,
p.id,p.page+1 as page,
p.image,p.image_contenttype,p.thumbnail,
o.ocr
from public.pages p
join catalog_id_uuid n on (p.catalog_id=n.id)
join catalogs c on (n.catalog_id = c.catalog_id)
join page_ocr o on (c.catalog_id=o.catalog_id and o.page+1=p.page)
),
b as (
 insert into media (media_id,title,contents,mime_type,thumbnail_png,ocr)
 select media_id,title,image,image_contenttype,thumbnail,ocr
 from a returning media_id
),
c as (
 insert into pages (page_id,catalog_id,page,media_id)
 select page_id,catalog_id,page,media_id
 from a
 returning *
)
select id,page_id from a;
#+END_SRC
